{"Events":"Events","Courses":"Unsere Kurse","Contact us":"Kontakt","Stories":"Erfolge","About us":"Über uns","Jobs":"Karriere beim DCI","Start your":"Deine digitale Karriere","Get involved":"Mach mit","Digital career":"startet hier.","Browse Courses":"Alle Kurse","Let’s connect! Our admissions team will call you soon to chat about our courses and your goals":"Tritt mit uns in Verbindung! Unsere Bildungsberatung wird sich in Kürze bei dir melden, um dich über unsere Kurse und deine möglichen Ziele bei uns zu informieren.","How to apply":"Bewerbungsinfos","Our Courses":"Unsere Kurse","The Digital Career Institute was born as an initiative to integrate refugees into digital jobs. Today it is committed to train anyone who wants to pursue a tech career.":"Das Digital Career Institute wurde aus der Idee heraus geboren, Geflüchtete schnell in digitale Berufe zu integrieren. Heute bildet es alle Digitalinteressierten zu fähigen Fachkräften aus.","Apply now":"Bewirb dich jetzt","Phone":"Telefon","Our Partners":"Unsere Partner","Apply Now":"Bewirb dich jetzt","Select your location here...":"Wo bist du?","Message":"Nachricht","Please, write your message here...":"Deine Nachricht...","I have read and agree to the":"Gelesen und akzeptiert:","Email":"Email","Stay up to date on the latest":"Melde dich für unseren Newsletter an.","Our Team":"Das Team","Our campuses":"Unsere Standorte","All events in our locations":"Alle Veranstaltungen finden jeden Mittwoch und Donnerstag virtuell als Webinare statt.","Community":"Community","Contact":"Kontakt","SEND":"Abschicken","We’re driven by a passionate belief in the work we do. This passion can be found in our classrooms, our office and in the work of our students. We’re proud to have created a buzzing environment driven by a sense of purpose and dedication.":"Wir arbeiten mit großer Motivation und Engagement an unserem Bildungsauftrag. Dieses Engagement zieht sich durch alle Bereiche unserer Lehre: Klassenräume, Office und Arbeiten unserer Teilnehmer zeichnen sich dadurch aus. Wir sind stolz auf ein vibrierendes Miteinander und Füreinander.","Get the latest news on events, project presentations and more":"Bleib auf dem Laufenden in der digitalen Welt. Der Digitalkosmos verändert sich rasant. Sei unmittelbar dabei bei Neuigkeiten, Events und Projekten.","Data Privacy":"Datenschutz","Subscribe":"Registriere dich","Company":"DCI","Campuses":"Campus","View course":"Kurs anzeigen","All courses":"Alle Kurse","All Rights Reserved":"Alle Rechte vorbehalten","Lets transform your future into one of our success stories":"Lass uns deine Zukunft in eine unserer Erfolgsstories verwandeln","Overview":"Übersicht","Companies":"Firmen","We measure success by impact. As we continue to empower people to begin their new careers and learn new skills we see the positive social impact of our work. On difficult days, we can turn to our students as a reminder of what success means as they go on to impact the industry in new ways.":"Unseren Einfluss messen wir an dem Erfolg unserer Teilnehmer. Der positive Einfluss unserer Ausbildungsmöglichkeiten spiegelt sich natürlich zuerst an den Karrieren unserer Teilnehmer.","Community is at the core of everything we do. Our students come from a wide variety of backgrounds and build a culture of honest communication and open collaboration. We work towards a common goal by bringing people together and work with a positive feedback culture based on trust.":"Unsere Gemeinschaft der Teilnehmer und Administration ist uns überaus wichtig für ein funktionierendes Leben auf dem Campus. Eine lebendige Multikulturalität sorgt dafür, dass neben des Lernens auch viel Platz zum Austausch besteht.","We’ve learned that to get the best out of people you have to be dedicated to get to know them. That’s why we focus on building a bond with every student, understanding their specific needs and adapting to their ways of learning. We put our students at the centre of the learning process.":"Wir engagieren uns für den individuellen Erfolg jedes einzelnen Teilnehmers bei uns am Campus. Ihr könnt euch sicher sein, dass der Lernerfolg im Zentrum unseres Schaffens liegt - euer Erfolg ist unser Erfolg!","Passion":"Leidenschaft","Impact":"Impact","Dedication":"Engagement","Show More":"Mehr","yes":"ja","no":"nein","Location":"Standort","We have locations all across germany":"Unsere Standorte sind deutschlandweit vertreten","Remote Learning":"Lernen von Zuhause","Learn from the comfort of your home in a virtual and professional learning enviroment. Our educational Counselors will bring you up to speed and help you secure your spot.":"Studiere in einem professionellem Umfeld, virtuell von Zuhause. Unsere BildungsberaterInnen helfen dir schnellstmöglich deinen Platz zu sichern.","Learn from anywhere in Germany":"Lerne von überall - Deutschlandweit","We will equip you with the right devices":"Wir rüsten dich mit der passenden Hardware aus","Pick the event that is right for you. You will be redirected to the Eventbrite website.":"Wähle die richtige Veranstaltung für dich aus. Du wirst dann zur Eventbrite Website weitergeleitet.","Click the register button and fill out your contact information.":"Klicke auf den register Knopf und fülle deine Kontaktdaten aus.","You will receive a reminder email two days before the event. In that email, click on the orange ‘Go to online event page’ button. You will be redirected to the Eventbrite website.":"Du wirst zwei Tage vor der Veranstaltung eine Erinnerung per Email erhalten. Klicke in dieser Email auf den orangenen ‘Go to online event page’ Knopf. Du wirst dann zu Eventbrite Website weitergeleitet.\n","Click on the video template that is shown and fill out your details on the Zoom registration page.":"Klicke auf die Video Vorlage und fülle deine Kontaktdaten auf der Zoom Registrierungsseite aus.","COURSE DETAILS":"KURS DETAILS","We offer much more than just teaching and hacking, such as":"Wir haben noch so viel mehr zu bieten als nur unseren Unterricht, zum Beispiel","FURTHER DETAILS":"WEITERE DETAILS","About this Course":"Über diesen Kurs","Teaching Mode":"Unterrichts Modus","Language":"Sprache","Duration":"Dauer","Availability":"Standorte","Download Course Overview":"Lade unsere Kursübersicht herunter","Our education counselors are always there to advise you.":"Unsere Bildungsberatung ist immer für dich da, um deine Fragen zu beantworten.","Join the tech disruption at DCI and launch your career in tech.":"Werde Teil des technischen Fortschritts und starte deine digitale Karriere.","Individual Appointment with DCI":"Beratungsgespräch mit der Bildungsberatung des DCI\n","Appointment with AfA/ JobCenter":"Gespräch mit deiner/m Arbeitsvermittler*in bei der Agentur für Arbeit oder dem Jobcenter","APPLICATION":"BEWERBUNG","REQUIREMENTS":"ANFORDERUNGEN","Computer Knowledge":"Computerkenntnisse","Partners":"Partner","Financing":"Finanzierung","Agentur für Arbeit / Jobcenter":"Agentur für Arbeit / Jobcenter","Book an Appointment":"Termin buchen","CHANCEN eG":"CHANCEN eG","CHANCEN eG offers you the possibility to take over your entire course fees if you commit to a later repayment. You only pay when you can afford it - after completion of your course and depending on your income.":"Die CHANCEN eG bietet dir die Möglichkeit deine gesamten Kursgebühren zu übernehmen, wenn du dich zu einer späteren Rückzahlung verpflichtest. Du bezahlst erst, wenn du es dir leisten kannst – nach Abschluss deines Kurses und abhängig von deinem Einkommen.","Learn more":"Erfahre mehr","Self payment":"SELBSTZAHLUNG","Financing with Chancen eG":"Finanzierung durch die Chancen eG","Self-payer":"Selbstzahler","or":"oder","Become our Hiring Partner":"Werde unser Firmenpartner","DCI Alumni":"DCI Alumni","Employment rate within 6 months":"Beschäftigungsrate innerhalb von 6 Monaten","stand out":"auszeichnet","Soft Skill Training":"Soft Skill Training","Agile project management":"Agiles Projektmanagement","Job coaching":"Job Coaching","benefit":"herausstechen","Participate at our events for free":"Nehmen Sie an unseren Final Events teil","Hire our graduates":"Stellenausschreibungen","Give an Industry Lecture":"Halten Sie eine Industry Lecture","Our Hiring Network":"Unser Hiring Netzwerk","company partners ":"Firmenpartner","We connect companies to the most talented Web Developers and Online Marketers.":"Sie sind auf der Suche nach talentierten Nachwuchskräften aus dem Tech-Bereich? Unser Career Success Team hilft Ihnen gerne dabei, die richtige Besetzung für Ihre Jobangebote zu finden. \n","Company Partners":"Firmen-partner","Our unique, in-depth courses provide our highly motivated students with a solid foundation. We work with a modern curriculum that incorporates the latest technologies, current trends in marketing and a variety of hands-on projects.":"Unsere einzigartigen Kurse bieten den hoch motivierten Studierenden eine solide Grundlagenausbildung. Wir arbeiten mit einem modernen Lehrplan, der die neuesten Technologien sowie aktuelle Trends im Marketing mit einer Vielzahl von praktischen Projekten kombiniert.","Time management":"Praktische Projekte","Language courses":"Sprachkurse","Mentoring":"Mentoring","Access our student profiles even before graduation":"Exklusiver Zugang zu den Profilen der Studierenden und Absolvent:innen","Host a company tour for our students":"Veranstalten Sie eine Company Tour","Become a Hiring Partner":"Werde Kooperationspartner","More than ":"Mehr als ","DCI Students":"DCI Studenten","Digital Careers Begin at the DCI.":"Digitale Karrieren beginnen im DCI.","Certified and practical training. Language courses. Career service.  Our all-round service for your customer.":"Zertifizierte und praktische Schulungen. Sprachkurse. Karriere-Service.  Unser Rundum-Service für Ihren Kunden.","Who we are":"Wer wir sind","We offer a range of courses that help our students enter the job market and future-proof their careers.":"Wir bieten eine Reihe von Kursen an, die unseren Studenten helfen, in den Arbeitsmarkt einzusteigen und ihre Karriere zukunftssicher zu machen.","Starts every":"Startet alle","Download complete course curriculum":"Lade das volle Curriculum herunter","Find your contact person":"Finde deine Kontaktperson","We are always there for you!":"Wir sind immer da für dich","Select location":"Wähle den Standort","Our all inclusive service":"Unser all-inclusive Service","In 4 steps to socialinsuranced employment":"In 4 Schritten zur sozialversicherten Beschäftigung","Further education to become an online marketing specialist or web and software developer incl. language courses.":"Weiterbildung zum Online-Marketing-Spezialisten oder Web- und Softwareentwickler inkl. Sprachkursen.","Career training and consulting in the DCI. Access to the wide network of companies and partners.":"Karrieretraining und Beratung im DCI. Zugriff auf das breite Netzwerk von Unternehmen und Partnern.","Placement in an employment employment subject to social insurance.":"Vermittlung in ein sozialversicherungspflichtiges Beschäftigungsverhältnis.","Sustainable":"Nachhaltig","Inclusion":"Inklusion","The digital sector is one of the fastest growing industries in Germany and is proving itself to be a sustainable and crisis-proof industry, especially now.":"Die Digitalbranche ist eine der am schnellsten wachsenden Industrien in Deutschland und erweist sich gerade jetzt als zukunftsfähige und krisenfeste Branche.","Job profiles of our graduates include: Programmer, IT Consultant, Web Designer, Online Marketing Manager, Social Media Manager and many more.":"Zu den Jobprofilen unserer Absolventen gehören: Programmierer, IT-Berater, Web-Designer, Online-Marketing-Manager, Social Media Manager und viele mehr.","Successstories":"Erfolgsgeschichten","See what our participants say":"Finden Sie heraus, was unsere Partnerunternehmen über DCI-Absolventen denken. Verschaffen Sie sich einen Eindruck aus erster Hand und entdecken Sie, warum unsere Talente herausragen. \n","no but soon":"Nein, aber bald","Please select an answer here...":"Bitte wähle eine Antwort...","Number":"Maßnahmennummer","Jobcenter":"Arbeitsvermittler","Our values set us apart.":"Unsere Werte zeichnen uns aus.","About Us":"Über uns","Thank you for applying!":"Vielen Dank für deine Bewerbung!","We will get in contact with you by email to schedule your personal interview. Make sure to check your spam folder if you can’t find it.":"Wir werden uns bei dir per E-Mail melden, um ein Persönliches Interview zu vereinbaren. Bitte prüfe auch deinen Spam-Ordner.","Personal Interview":"Persönliches Interview","You will talk with one of our Admission team members, who is going to assess your motivation and goals. You will get to know us and we will answer all of your questions.":"Du wirst ein Beratungsgespräch mit der Bildungsberatung des DCI führen, um deine Motivation und Ziele einzuschätzen. Damit wirst du uns kennen lernen und wir beantworten auch alle deine Fragen.","Join Our Course":"Kurs starten","If you succeed in the admission process, you will then join our 12 months course plus 2 months internship.":"Wenn das Beratungsgespräch für beide Seiten gut läuft, fängst du mit dem 12 Monate Intensivtraining + 2 Monate Praktikum an.","Combined with your technical and practical experience acquired, we will support and mentor you through the start of your digital career!":"Mit deine neuen technischen und praktischen Erfahrung werden wir dich beim Start in deiner digitale Karriere begleiten und unterstützen!","Start your digital career":"Fange deine Digitale Karriere an","DCI offers much more than what is normally provided by ordinary bootcamps. Our comprehensive courses are designed to provide students with in-depth knowledge of tech topics. At the end of every DCI course, our students have become well-rounded professionals who are ready to take the next step in their careers.":"Aufgrund der Dauer und der Intensität unserer Kurse bietet das DCI viel mehr als gewöhnliche Bootcamps. Unsere umfassenden Kurse vermitteln den Studierenden ein tiefgehendes Wissen über technische Themen und relevante Soft Skills. Am Ende jedes Kurses absolvieren unsere Studierenden ein zweimonatiges Pflichtpraktikum, wodurch sie erste berufliche Erfahrungen im Tech-Bereich sammeln.\n","Our partners benefit from the following all for free!":"Unser Ziel besteht darin Ihren Auswahlprozess zu optimieren und sie direkt mit talentierten Nachwuchskräften in Kontakt zu bringen. Hierfür bieten wir eine breite Palette an Lösungen und stehen Ihnen bei Fragen jederzeit zur Verfügung.","Every 4-8 weeks we have a new graduation class in each of our locations":"Wir haben großartige Talente, die ihrem Karrierestart entgegen fiebern. Erhalten Sie exklusiven Zugang zu ihren Profilen und finden Sie die passende Unterstützung für Ihr Unternehmen.","Receive regular invitations to our Final Events and meet our graduates":"Alle sechs Wochen schließen neue Talente ihren Kurs ab. Im Rahmen ihres Final Event geben sie Ihnen gerne einen Einblick in ihre Abschlussprojekte und ihre praktischen Fähigkeiten.","Share your industry knowledge by holding a lecture on a topic from our curriculum":"Inspirieren Sie unsere Studierenden, indem sie ein Industry Lecture halten. Gerne stehen wir mit Themenvorschlägen unterstützend zur Verfügung. Wir freuen uns aber umso mehr, wenn Sie Ihre Begeisterung für ein Thema ihrer Wahl mit unseren Studierenden teilen.\n","Hire our students for Intern positions, and our graduates for Junior/Trainee positions ":"Sind Sie auf der Suche nach neuen Talenten oder müssen eine Stelle neu besetzen? Teilen Sie Ihre Stellenausschreibung mit unseren Absolvent:innen und erhöhen Sie auf diese Weise die Sichtbarkeit Ihres Unternehmens.","See what companies are saying about our students.":"Finden Sie heraus, was unsere Partnerunternehmen über DCI-Absolvent:innen denken. Verschaffen Sie sich einen Eindruck aus erster Hand und entdecken Sie, was unsere Talente besonders macht.\n","We are an AZAV certified German educational institution. This not only allows DCI to be funded by the Agentur für Arbeit and Jobcenter, but also ensures the continuous quality of our courses. The certification is recognized in Germany and all of Europe.":"Wir sind ein nach AZAV zertifizierter deutscher Bildungsträger. Damit kann DCI von der Agentur für Arbeit und dem Jobcenter gefördert werden, es sichert auch die kontinuierliche Qualität unserer Kurse. Die Zertifizierung ist in Deutschland und ganz Europa anerkannt.","We are collaborating together with AWS to support learners in building new careers in cloud computing. The participants will learn everything they need to know for an entry level cloud career such as cloud operations, site reliability and infrastructure support.":"Gemeinsam mit Amazon Web Services (AWS) arbeiten wir daran, unsere Studierenden beim Aufbau einer neuen Karriere im Bereich Cloud Computing zu unterstützen. Die Teilnehmenden lernen alles, was sie für den Einstieg in eine Karriere in der Cloud wissen müssen, wie z.B. Cloud Operations, Site Reliability und Infrastructure Support.\n","Campuses in Berlin, Düsseldorf, Hamburg and Leipzig.":"Standorte in Berlin, Düsseldorf, Hamburg, Frankfurt am Main und Leipzig.","Hiring partners in Germany.":"Firmenpartner","The Digital Career Institute was born as an initiative to integrate refugees into digital jobs. Today we are committed to training anyone interested in pursuing a career in tech. We provide everything our students need to succeed, including computer equipment, language books, and mobile internet when necessary.":"Das Digital Career Institute wurde als Initiative zur Integration von Geflüchteten in digitale Berufe gegründet. Heute engagieren wir uns dafür, allen Interessierten eine Karriere in der Digitalbranche zu ermöglichen. Wir stellen unseren Studierenden alles zur Verfügung, was sie  für eine erfolgreiche Ausbildung benötigen, einschließlich Computerausrüstung, Lehrbücher und wenn nötig, mobiles Internet..","Our Mission":"Unsere Mission","Students & alumni from all over the world.":"Studierende & Alumni aus der ganzen Welt.","Courses started since we were founded.":"Begonnene Kurse.","Placement rate":"Vermittlungsrate","Different nationalities of students and teachers.":"verschiedene Nationalitäten von Studierende und Lehrern.","We work with over 400 hiring partners to match our students with tech jobs after graduation, including unique networking opportunities. DCI alumni work in top tech companies as front-end developers, full-stack developers, technical product managers, marketing managers, social media managers and more.":"Wir arbeiten mit über 600 Firmenpartnern zusammen, um unsere Studierenden nach erfolgreichem Abschluss in sichere Arbeitsverhältnisse zu integrieren. Unter anderem auch durch exklusive Networking-Angebote. Unsere Absolvent:innen arbeiten in den führenden IT-Unternehmen der Branche, zum Beispiel als Frontend - oder Fullstack-Developer, Produktmanager, Performance Marketing Manager oder SEO Spezialisten.","Our students come from all around the world and have different professional backgrounds. Discover how the DCI experience changed their lives.":"Unsere Studierenden kommen aus über 90 verschiedenen Nationen und den unterschiedlichsten beruflichen Hintergründen. Erfahre, wie das DCI ihre Leben verändert hat.","Our admission team is always there for you regardless of your location":"Unsere Bildungsberater*innen sind immer für dich da!","View all upcoming events":"Alle kommenden Veranstaltungen anzeigen","Where Our Graduates Work":"Wo unsere Absolventen arbeiten","Build a strong foundation at the Digital Career Institute with our in-depth courses. Learn the skills to launch your new career in web development, online marketing or cloud computing.":"Schaffe die Grundlage für Deine digitale Karriere. Lerne die Fähigkeiten, die Du brauchst, um eine erfolgreiche neue Karriere in Webentwicklung, Onlinemarketing oder Cloud Computing zu beginnen.","Register":"Registrieren","Upcoming Events":"Kommende Events","AVAZ Certified":"AZAV zertifiziert","Delivery Hero Tech Academy":"Delivery Hero Tech-Akademie","Meet Our Hiring Partners":"Unsere Partner","How to register for an event:":"Wie to register for an event:","Who We Are?":"Wer sind wir?"}